tutorials/10unsteadyBB_sym/0/Tlift0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Tlift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
3600
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    Floor
    {
        type            fixedValue;
        value           uniform 1;
    }
    Ceiling
    {
        type            zeroGradient;
    }
    Left
    {
        type            zeroGradient;
    }
    Right
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
