tutorials/10unsteadyBB_sym/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Floor
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    Ceiling
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }


    Left
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    Right
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    Inlet
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    Outlet
     {
        type            fixedValue;
 	rho             rhok;
        value              uniform 0;
     }


    frontAndBack
    {
        type empty;
    }

}

// ************************************************************************* //
