tutorials/10unsteadyBB_sym/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    Floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          180;
        startFace       7000;
    }
    Ceiling
    {
        type            wall;
        inGroups        1(wall);
        nFaces          180;
        startFace       7180;
    }
    Left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       7360;
    }
    Right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       7380;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          7200;
        startFace       7400;
    }
)

// ************************************************************************* //
