tutorials/10unsteadyBB_sym/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;

// Number of modes to output and to use for projection
NmodesUout 25;
NmodesUproj 20;

NmodesPout 10;
NmodesPproj 0;

NmodesSUPout 0;
NmodesSUPproj 0;

NmodesTout 25;
NmodesTproj 20;

// Output format to save market vectors.
OutPrecision 20;
OutType fixed;
